docs/api/cfd/cases/floating_body_decay/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    stationaryWalls { type noSlip; }
    atmosphere { type pressureInletOutletVelocity; value uniform (0 0 0); }
    floatingObject { type movingWallVelocity; value uniform (0 0 0); }
}
