docs/api/cfd/cases/floating_body_decay/0/alpha.water
FoamFile { version 2.0; format ascii; class volScalarField; object alpha.water; }

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    stationaryWalls { type zeroGradient; }
    atmosphere { type inletOutlet; inletValue uniform 0; value uniform 0; }
    floatingObject { type zeroGradient; }
}
