docs/api/cfd/cases/floating_body_decay/0/epsilon
FoamFile { version 2.0; format ascii; class volScalarField; object epsilon; }

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.1;
boundaryField
{
    stationaryWalls { type epsilonWallFunction; value uniform 0.1; }
    atmosphere { type inletOutlet; inletValue uniform 0.1; value uniform 0.1; }
    floatingObject { type epsilonWallFunction; value uniform 0.1; }
}
