docs/api/cfd/cases/floating_body_decay/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.1;
boundaryField
{
    stationaryWalls { type kqRWallFunction; value uniform 0.1; }
    atmosphere { type inletOutlet; inletValue uniform 0.1; value uniform 0.1; }
    floatingObject { type kqRWallFunction; value uniform 0.1; }
}
