docs/api/cfd/cases/floating_body_decay/0/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    stationaryWalls { type nutkWallFunction; value uniform 0; }
    atmosphere { type calculated; value uniform 0; }
    floatingObject { type nutkWallFunction; value uniform 0; }
}
