docs/api/cfd/cases/floating_body_decay/0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    stationaryWalls { type fixedFluxPressure; gradient uniform 0; value uniform 0; }
    atmosphere
    {
        type totalPressure; rho rho; psi none; gamma 1;
        p0 uniform 0; value uniform 0;
    }
    floatingObject { type fixedFluxPressure; gradient uniform 0; value uniform 0; }
}
