docs/api/cfd/cases/floating_body_decay/0/pointDisplacement
FoamFile { version 2.0; format ascii; class pointVectorField; object pointDisplacement; }

dimensions      [0 1 0 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    stationaryWalls { type fixedValue; value uniform (0 0 0); }
    atmosphere { type fixedValue; value uniform (0 0 0); }
    floatingObject { type calculated; }
}
