docs/api/cfd/cases/floating_body_decay/constant/dynamicMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object dynamicMeshDict; }

dynamicFvMesh       dynamicMotionSolverFvMesh;
motionSolverLibs    (sixDoFRigidBodyMotion);
motionSolver        sixDoFRigidBodyMotion;

patches             (floatingObject);
innerDistance       0.05;
outerDistance       0.25;

centreOfMass        (0.5 0.45 0.483333);
mass                15;
momentOfInertia     (0.3625 0.425 0.1625);
rhoInf              1;
report              on;
accelerationRelaxation 0.7;

solver
{
    type            Newmark;
}

constraints
{
    // Pure heave: translation along z only, no rotation.
    fixedLine
    {
        sixDoFRigidBodyMotionConstraint line;
        centreOfRotation (0.5 0.45 0.483333);
        direction        (0 0 1);
    }
    fixedOrientation
    {
        sixDoFRigidBodyMotionConstraint orientation;
    }
}
