docs/api/cfd/cases/floating_body_decay/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// floatingObject tutorial tank: 1 m^3, 20x20x30 cells; the body is cut out
// by topoSet + subsetMesh (system/topoSetDict).
scale 1;
vertices
(
    (0 0 0) (1 0 0) (1 1 0) (0 1 0)
    (0 0 1) (1 0 1) (1 1 1) (0 1 1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (20 20 30) simpleGrading (1 1 1) );
edges ();
boundary
(
    stationaryWalls
    {
        type wall;
        faces ( (0 3 2 1) (2 6 5 1) (1 5 4 0) (3 7 6 2) (0 4 7 3) );
    }
    atmosphere { type patch; faces ( (4 5 6 7) ); }
    floatingObject { type wall; faces (); }
);
mergePatchPairs ();
