docs/api/cfd/cases/floating_body_decay/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     interFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         14;
deltaT          0.01;
writeControl    adjustable;
writeInterval   0.1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           1;
maxAlphaCo      1;
maxDeltaT       1;
functions
{
    bodyState
    {
        type            sixDoFRigidBodyState;
        libs            (sixDoFRigidBodyState);
        angleFormat     degrees;
        writeControl    timeStep;
        writeInterval   1;
    }
}
