docs/api/cfd/cases/floating_body_decay/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 1;
        cAlpha          1;
        MULESCorr       yes;
        nLimiterIter    5;
        alphaApplyPrevCorr yes;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-5;
            relTol          0;
            smoother        DICGaussSeidel;
            cacheAgglomeration no;
        }
        tolerance       1e-05;
        relTol          0;
        maxIter         100;
    }
    p_rgh { solver GAMG; tolerance 1e-8; relTol 0.01; smoother DIC; }
    p_rghFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-8;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
        }
        tolerance       1e-8;
        relTol          0;
        maxIter         20;
    }
    "(U|k|epsilon)"
    {
        solver smoothSolver; smoother GaussSeidel;
        tolerance 1e-6; relTol 0.1; nSweeps 1;
    }
    "(U|k|epsilon)Final"
    {
        solver smoothSolver; smoother GaussSeidel;
        tolerance 1e-6; relTol 0; nSweeps 1;
    }
}
PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    3;
    nCorrectors         1;
    nNonOrthogonalCorrectors 0;
    correctPhi          yes;
    moveMeshOuterCorrectors yes;
}
relaxationFactors { equations { ".*" 1; } }
