docs/api/cfd/cases/floating_body_decay/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }

defaultFieldValues ( volScalarFieldValue alpha.water 0 );
regions
(
    boxToCell
    {
        box (-100 -100 -100) (100 100 0.5368);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
);
